<b>PANDAS</b>

In [2]:
import pandas as pd
import numpy as np
my_series = pd.Series([5,6,7,8,9,10])
my_series

0     5
1     6
2     7
3     8
4     9
5    10
dtype: int64

In [3]:
my_series.index

RangeIndex(start=0, stop=6, step=1)

In [4]:
my_series.values

array([ 5,  6,  7,  8,  9, 10], dtype=int64)

In [5]:
my_series2 = pd.Series([5,6,7,8,9,10], index=['a','b','c','d','e','f'])
my_series2

a     5
b     6
c     7
d     8
e     9
f    10
dtype: int64

In [6]:
my_series[[4]]

4    9
dtype: int64

In [7]:
my_series2[['b']]

b    6
dtype: int64

In [8]:
my_series2[['a','c','f']]=0
my_series2

a    0
b    6
c    0
d    8
e    9
f    0
dtype: int64

In [9]:
my_series2[(my_series2>0)]

b    6
d    8
e    9
dtype: int64

In [10]:
my_series3 = pd.Series({'a':5,'b':6,'c':7})
my_series3

a    5
b    6
c    7
dtype: int64

In [11]:
#именование столбцов
my_series3.name = "numbers"
my_series3.index.name = "letters"
my_series3

letters
a    5
b    6
c    7
Name: numbers, dtype: int64

<b>Pandas DataFrame</b>   
типа таблица, столбцами выступают объекты Series

In [12]:
df = pd.DataFrame({"country":["Russia", "France", "USA"], 
                   "population":[147, 56, 345],
                  "square":[1234556, 2356443, 123748]})
df

  country  population   square
0  Russia         147  1234556
1  France          56  2356443
2     USA         345   123748

In [13]:
df.population

0    147
1     56
2    345
Name: population, dtype: int64

In [14]:
type(df), type(df.population)

(pandas.core.frame.DataFrame, pandas.core.series.Series)

In [15]:
df.index= ['RU','FR','US']
df

   country  population   square
RU  Russia         147  1234556
FR  France          56  2356443
US     USA         345   123748

<u><b>ИМПОРТ ДАННЫХ</b></u>

In [16]:
'''
pd.read_csv('filename')
pd.read_excel('filename')
pd.read_sql(querty, connection_object)
pd.read_table(filename)
pd.read_json(json_string)
pd.read_html(url)
pd.read_clipboard()
pd.DataFrame(dict)
'''

"\npd.read_csv('filename')\npd.read_excel('filename')\npd.read_sql(querty, connection_object)\npd.read_table(filename)\npd.read_json(json_string)\npd.read_html(url)\npd.read_clipboard()\npd.DataFrame(dict)\n"

In [17]:
ml = pd.read_csv('C:\exmpl.csv')
ml.head() #первые пять, .tail - последние пять

,year,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
0,2011,A,"Agriculture, Forestry and Fishing",a_0,Activity unit,46134,COUNT
1,2011,A,"Agriculture, Forestry and Fishing",a_0,Rolling mean employees,0,COUNT
2,2011,A,"Agriculture, Forestry and Fishing",a_0,Salaries and wages paid,279,DOLLARS(millions)
3,2011,A,"Agriculture, Forestry and Fishing",a_0,"Sales, government funding, grants and subsidies",8187,DOLLARS(millions)
4,2011,A,"Agriculture, Forestry and Fishing",a_0,Total income,8866,DOLLARS(millions)

In [18]:
mailru= pd.read_html("https://mail.ru/")
mailru

[                                                   0                1
 0  Mail.ruПочтаМой МирОдноклассникиВКонтактеИгрыЗ...  РегистрацияВход,
     0      1
 0 NaN  выход,
                  0
 0  РегистрацияВход,
          0       1      2     3     4     5     6        7
 0  Новости  Москва  Спорт  Авто  Кино  Леди  Игры  Hi-Tech,
                                                    0  \
 0  Погода-3, ночью -10завтра -4mr.counter('d12654...

                                                    1  \
 0  Торги ММВБ$75.15+0.18€80.20+0.75mr.counter('d6...

                                                    2
 0  ГороскопыСкорпион — сегодня вы сделаете много ...  ,
               0                                        1  \
 0  ТВ программа  Нефть83.90+0.02mr.counter('d12403154');

                              2
 0  Начните делать добрые дела!  ]

что если файл слишком большой и не влезает в оперативную память

In [19]:
c_size = 10000
for gm_chunk in pd.read_csv('C:\exmpl.csv', sep=',', chunksize=c_size):
    print(gm_chunk.shape)

(10000, 7)
(7028, 7)

<b>Экспорт данных</b>

In [20]:
"""
df.to_csv(filename)
df.to_excel(filename)
df.to_sql(table_name, connrction_object)
df.to_json(filename)
df.to_html(filename)
df.to_clipboard()
"""

'\ndf.to_csv(filename)\ndf.to_excel(filename)\ndf.to_sql(table_name, connrction_object)\ndf.to_json(filename)\ndf.to_html(filename)\ndf.to_clipboard()\n'

<b>Доступ к данным</b>

<ul>
    <li>
        .loc - для доступа по строковой метке
    </li>
    <li>
        .iloc - для доступа по числовому значению (начиная от 0)
    </li>
</ul>

In [21]:
df.loc['RU']

country        Russia
population        147
square        1234556
Name: RU, dtype: object

In [22]:
df.iloc[0]

country        Russia
population        147
square        1234556
Name: RU, dtype: object

In [23]:
#индекс + колонки
#первая часть относится к строкам, вторая к столбцам
df.loc[['FR', 'RU'], 'population']

FR     56
RU    147
Name: population, dtype: int64

In [24]:
df[df.population > 60][['country','square']]

   country   square
RU  Russia  1234556
US     USA   123748

In [25]:
filters = (df.country== 'Russia')
df[filters]

   country  population   square
RU  Russia         147  1234556

In [25]:
#создаем новую строку
df['density'] = df['population'] / df['square'] *10**5
df

   country  population   square     density
RU  Russia         147  1234556   11.907115
FR  France          56  2356443    2.376463
US     USA         345   123748  278.792385

In [26]:
#при дропе колонок нужно перезаписывать данные в том или ином виде
df.drop(['density'],axis=1)
# df.drop(['density'], axis='columns', inplace = True)

   country  population   square
RU  Russia         147  1234556
FR  France          56  2356443
US     USA         345   123748

In [27]:
df = df.drop(['density'], axis=1)
df

   country  population   square
RU  Russia         147  1234556
FR  France          56  2356443
US     USA         345   123748

In [28]:
df = df.rename(columns={"Country code": "country_code"})
df

   country  population   square
RU  Russia         147  1234556
FR  France          56  2356443
US     USA         345   123748

In [29]:
#вытаскивает n самых больших элементов

df.nlargest(2, "population")

   country  population   square
US     USA         345   123748
RU  Russia         147  1234556

In [30]:
df.nsmallest(2,"square")

   country  population   square
US     USA         345   123748
RU  Russia         147  1234556

<b>Работа с данными с помощью Pandas</b>   
Данные

In [31]:
df = pd.read_csv("C:/Users/alexo/OneDrive/Рабочий стол/py обуч/meteorite-landings.csv", sep=",")
df.head()

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.77500,6.08333,"(50.775000, 6.083330)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.18333,10.23333,"(56.183330, 10.233330)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.21667,-113.00000,"(54.216670, -113.000000)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.88333,-99.90000,"(16.883330, -99.900000)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.16667,-64.95000,"(-33.166670, -64.950000)"

In [32]:
#по умолчанию выводится 20 столбоцов и 60 строк, но можно менять при помощи:
pd.set_option("display.max_columns", 100)
pd.set_option("display.max_rows", 100)

In [33]:
#полезно (сколько цифр после запятой)
#df.set_option("display.precision", 3)

In [34]:
#457116 наложений и 10 колонок
df.shape

(45716, 10)

In [35]:
df.columns

Index(['name', 'id', 'nametype', 'recclass', 'mass', 'fall', 'year', 'reclat',
       'reclong', 'GeoLocation'],
      dtype='object')

In [36]:
ord('a')

97

In [37]:
ord('z')

122

In [38]:
ord('0')

48

In [39]:
import statistics as st
st.mean([True, True, False])

0.6666666666666666

*общая инфа по датафрейму*

In [43]:
#числовыые хорактеристики
df.describe()

                 id          mass          year        reclat       reclong
count  45716.000000  4.558500e+04  45428.000000  38401.000000  38401.000000
mean   26889.735104  1.327808e+04   1991.772189    -39.122580     61.074319
std    16860.683030  5.749889e+05     27.181247     46.378511     80.647298
min        1.000000  0.000000e+00    301.000000    -87.366670   -165.433330
25%    12688.750000  7.200000e+00   1987.000000    -76.714240      0.000000
50%    24261.500000  3.260000e+01   1998.000000    -71.500000     35.666670
75%    40656.750000  2.026000e+02   2003.000000      0.000000    157.166670
max    57458.000000  6.000000e+07   2501.000000     81.166670    354.473330

In [45]:
#нечисловые
df.describe(include=["object"])

          name nametype recclass   fall           GeoLocation
count    45716    45716    45716  45716                 38401
unique   45716        2      466      2                 17100
top     Aachen    Valid       L6  Found  (0.000000, 0.000000)
freq         1    45641     8285  44609                  6214

по нечисловым признакам можно изучить распределение

In [48]:
df.recclass.value_counts()[:5]

L6    8285
H5    7142
L5    4796
H6    4528
H4    4211
Name: recclass, dtype: int64

Информация о колонках датафрейма

In [50]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass         45585 non-null  float64
 5   fall         45716 non-null  object
 6   year         45428 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float64(4), int64(1), object(5)
memory usage: 3.5+ MB
None

В случае работы с большими датафреймами занимается память - крит фактор:

In [51]:
for dtype in ['float', 'int', 'object']:
    selected_dtype = df.select_dtypes(include=[dtype])
    mean_usage_b = selected_dtype.memory_usage(deep=True).mean()
    mean_usage_mb = mean_usage_b /1024 **2
    print("Average memory usage for {} columns: {:03.2f} MB".format(dtype, mean_usage_mb))

Average memory usage for float columns: 0.28 MB
Average memory usage for int columns: 0.17 MB
Average memory usage for object columns: 2.41 MB

*Мы можем закодировать колонки типа object в числовые эквиваленты, например, с помощью pd.factorize*   
   
изменим тип колонок в том случае, если это необходимо

In [52]:
df['mass'] = df['mass'].astype("float32")

In [53]:
#обратить внимание, как изменяется размер занимаемой памяти
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  object
 4   mass         45585 non-null  float32
 5   fall         45716 non-null  object
 6   year         45428 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: float32(1), float64(3), int64(1), object(5)
memory usage: 3.3+ MB
None

<b>Тип данных КАТЕГОРИЯ</b>   
*позволяет более эффективно работать с категориальными признаками*
   
   
Что такое категориальные признаки?

In [56]:
[(col, df[col].nunique()) for col in df.columns]

[('name', 45716),
 ('id', 45716),
 ('nametype', 2),
 ('recclass', 466),
 ('mass', 12576),
 ('fall', 2),
 ('year', 268),
 ('reclat', 12738),
 ('reclong', 14640),
 ('GeoLocation', 17100)]

In [60]:
unique_counts = pd.DataFrame.from_records([(col, df[col].nunique()) for col in df.columns], 
                                          columns = ["Column_name", "Num_Unique"]).sort_values(by=["Num_Unique"])
unique_counts

   Column_name  Num_Unique
2     nametype           2
5         fall           2
6         year         268
3     recclass         466
4         mass       12576
7       reclat       12738
8      reclong       14640
9  GeoLocation       17100
0         name       45716
1           id       45716

reccalss (класс метеорита) - отличный кандидат для категориального признака (тк наименьшее количество уникальных элементов)

In [66]:
df_with_cat = df.copy()

In [67]:
df_with_cat["recclass"] = df_with_cat["recclass"].astype("category")

Зачем нужны категориальные признаки Pandas:
- позволяют более эффективно обрабатывать категориадьные признаки
- многие питоновские библиотеки имеют встроенные методы по работе с категориальными признаками
- таки признаки занимают меньше места и так же хорошо сказываются на производительности

In [68]:
print(df_with_cat.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45716 entries, 0 to 45715
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         45716 non-null  object
 1   id           45716 non-null  int64
 2   nametype     45716 non-null  object
 3   recclass     45716 non-null  category
 4   mass         45585 non-null  float32
 5   fall         45716 non-null  object
 6   year         45428 non-null  float64
 7   reclat       38401 non-null  float64
 8   reclong      38401 non-null  float64
 9   GeoLocation  38401 non-null  object
dtypes: category(1), float32(1), float64(3), int64(1), object(4)
memory usage: 3.1+ MB
None

In [2]:
import numpy

In [3]:


%%time
numbers = list()
for i in input("Введите числа через пробел: ").split():
        numbers.append(i)
numbers.sort(reverse = True)

print("Максимальное значение из списка:", numbers[0])

Введите числа через пробел: 1 2 3 4
Максимальное значение из списка: 4
Wall time: 3.72 s

In [5]:
%%time
a = list(map(int, input().split()))
max= - (10**10)
i=0
print(a)
while i < len(a):
    if a[i]>max:
        max=a[i]
    i+=1
print(max)

1 2 3 4
[1, 2, 3, 4]
4
Wall time: 3.5 s

In [1]:
import pandas as pd
import numpy as np


# ****************** Series *****************************
# Значения - values и индекс index
# Создание из списка
B = pd.Series([4, 7, -5, 3])
print(B,'\n')
# Две компоненты
B.values # np.ndaray
B.index #  Свой класс
type(B.index) # RangeIndex
dir(B.index)
print(B.index.__doc__)
B.index.start
B.index.values # np.ndarray
# Превращаем в массив и в список
np.array(B.index)
list(B.index) 
B[1]

0    4
1    7
2   -5
3    3
dtype: int64


    Immutable Index implementing a monotonic integer range.

    RangeIndex is a memory-saving special case of Int64Index limited to
    representing monotonic ranges. Using RangeIndex may in some instances
    improve computing speed.

    This is the default index type used
    by DataFrame and Series when no explicit index is provided by the user.

    Parameters
    ----------
    start : int (default: 0), range, or other RangeIndex instance
        If int and "stop" is not given, interpreted as "stop" instead.
    stop : int (default: 0)
    step : int (default: 1)
    dtype : np.int64
        Unused, accepted for homogeneity with other index types.
    copy : bool, default False
        Unused, accepted for homogeneity with other index types.
    name : object, optional
        Name to be stored in the index.

    Attributes
    ----------
    start
    stop
    step

    Methods
    -------
    from_range

    See Also
    --------
    Index : The base pandas Index type.
    Int64Index : Index of int64 data.

7

In [8]:
B.index.values

array([0, 1, 2, 3], dtype=int64)

In [9]:
# Задание своего индекса
z = pd.Index(['a', 'b', 'c', 'd']) # Делаем сами 
B.index = z
# Индекс при создании
D = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c']) 
print(D.index.__doc__)
print(D,'\n')
D.index.values
np.array(D.index)
D['a']

    Immutable sequence used for indexing and alignment. The basic object
    storing axis labels for all pandas objects.

    Parameters
    ----------
    data : array-like (1-dimensional)
    dtype : NumPy dtype (default: object)
        If dtype is None, we find the dtype that best fits the data.
        If an actual dtype is provided, we coerce to that dtype if it's safe.
        Otherwise, an error will be raised.
    copy : bool
        Make a copy of input ndarray.
    name : object
        Name to be stored in the index.
    tupleize_cols : bool (default: True)
        When True, attempt to create a MultiIndex if possible.

    See Also
    --------
    RangeIndex : Index implementing a monotonic integer range.
    CategoricalIndex : Index of :class:`Categorical` s.
    MultiIndex : A multi-level, or hierarchical Index.
    IntervalIndex : An Index of :class:`Interval` s.
    DatetimeIndex : Index of datetime64 data.
    TimedeltaIndex : Index of timedelta64 data.
    PeriodIndex : Index of Period data.
    NumericIndex : Index of numpy int/uint/float data.
    Int64Index : Index of purely int64 labels (deprecated).
    UInt64Index : Index of purely uint64 labels (deprecated).
    Float64Index : Index of  purely float64 labels (deprecated).

    Notes
    -----
    An Index instance can **only** contain hashable objects

    Examples
    --------
    >>> pd.Index([1, 2, 3])
    Int64Index([1, 2, 3], dtype='int64')

    >>> pd.Index(list('abc'))
    Index(['a', 'b', 'c'], dtype='object')

d    4
b    7
a   -5
c    3
dtype: int64

-5

In [11]:
# Создание из списка списков
F1 = pd.DataFrame([[1, 2], [3,4]]) 
# Основные атрибуты
print(F1.index, F1.columns) # Два индекса
F1.dtypes
F1.values

# Создание из словаря
W1 = {'year':[2000, 2001, 2002, 2001, 2002],
'pop':[1.5, 1.7, 3.6, 2.4, 2.9], 'inc':[200, 340, 450, 236, 123], 
'tp':['a1' ,'b2' ,'a1', 'b1', 'a1']}
F2 = pd.DataFrame(W1, index=['A', 'A', 'A' , 'B' , 'B'])

RangeIndex(start=0, stop=2, step=1) RangeIndex(start=0, stop=2, step=1)

In [23]:
F2

   year  pop  inc  tp
A  2000  1.5  200  a1
A  2001  1.7  340  b2
A  2002  3.6  450  a1
B  2001  2.4  236  b1
B  2002  2.9  123  a1

In [2]:
import os
import pandas as pd


df_AboutVacancy = pd.read_csv("C:\work\data\овакансии1.csv", sep=";")

df_AboutVacancy

,ID_ВАК,ЗАР_ПЛАТ,ТРЕБ_НАВ,ТРЕБ_ОП,РЕЖ_РАБ,ФОРМ_ЗАН
0,1,114040,"numpy,excel,python",от 5 лет,Полный рабочий день,Гибрид
1,2,268128,"excel,pandas,Unreal Engine 5,python,numpy,java...",Нет опыта,4 часа в день,Гибрид
2,3,114674,python,1-3 года,4 часа в день,Удаленная работа
3,4,258110,"numpy,excel,python,c++",1-3 года,4 часа в день,Гибрид
4,5,81481,python,Нет опыта,Полный рабочий день,Офис
...,...,...,...,...,...,...
4995,4996,95497,"excel,pandas,python,numpy,java,c++",Нет опыта,Полный рабочий день,Удаленная работа
4996,4997,204142,"numpy,excel,python,c++",1-3 года,4 часа в день,Гибрид
4997,4998,123117,"numpy,excel,python",1-3 года,4 часа в день,Офис
4998,4999,69222,"numpy,python",Нет опыта,4 часа в день,Офис
4999,5000,70357,"numpy,python",Нет опыта,Полный рабочий день,Гибрид